time_out=int(input('введите время отключения, например 14: '))

time=24 # Сутки 24 часа
dark=4 # Время когда света нет
light=5 # Время когда свет есть

dark_out=time_out + dark
light_up=time_out + dark + light

times=['00:00', '01:00', '02:00', '03:00', '04:00', '05:00', '06:00', '07:00', '08:00', '09:00', '10:00', '11:00', '12:00', '13:00', '14:00', '15:00', '16:00', '17:00', '18:00', '19:00', '20:00', '21:00', '22:00', '23:00', '00:00', '01:00', '02:00', '03:00', '04:00', '05:00', '06:00', '07:00', '08:00']

if time_out < time:
	if dark_out:
		print("•> время включения:", times[dark_out])
	if light_up:
		print("•> время отключения:", times[light_up])
else:
	print("{•••} Ошибка! В сутках 24 часа")